# Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np

# Step 2. Create 3 differents Series, each of length 100, as follows:

- The first a random number from 1 to 4
- The second a random number from 1 to 3
- The third a random number from 10,000 to 30,000

In [6]:
s1 = pd.Series(np.random.randint(1,high=5,size=100))
s2 = pd.Series(np.random.randint(1,high=3,size=100))
s3 = pd.Series(np.random.randint(10000,high=30001,size=100))

# Step 3. Let's create a DataFrame by joinning the Series by column

In [9]:
housemkt = pd.concat([s1,s2,s3],axis=1)
housemkt.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 3 columns):
0    100 non-null int64
1    100 non-null int64
2    100 non-null int64
dtypes: int64(3)
memory usage: 2.4 KB

# Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [12]:
housemkt.rename(columns={0:'bedrs',1:'bathrs',2:'price_sqr_meter'},inplace=True)
housemkt.head()

   bedrs  bathrs  price_sqr_meter
0      2       1            25601
1      3       2            26890
2      3       1            26323
3      2       1            13379
4      3       1            11404

# Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [13]:
s1.shape

(100,)

In [15]:
# join concat the values
bigcolumn = pd.concat([s1, s2, s3], axis=0)

# it is still a Series, so we need to transform it to a DataFrame
bigcolumn = bigcolumn.to_frame()
print(type(bigcolumn))

bigcolumn.shape

<class 'pandas.core.frame.DataFrame'>

(300, 1)

# Step 6. Ops it seems it is going only until index 99. Is it true?

In [17]:
len(bigcolumn)

300

# Step 7. Reindex the DataFrame so it goes from 0 to 299

In [20]:
bigcolumn.reset_index(drop=True,inplace=True)
bigcolumn.tail()

         0
295  29750
296  14935
297  28279
298  20379
299  27729